lkolbly/cmsis-svd/data/TexasInstruments/LM3S5T36.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL</name>
      <description>Register map for SYSCTL peripheral</description>
      <groupName>SYSCTL</groupName>
      <prependToName>SYSCTL</prependToName>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DID0</name>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID0_MIN</name>
              <description>Minor Revision</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_1</name>
                  <description>First metal layer change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_2</name>
                  <description>Second metal layer change</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_MAJ</name>
              <description>Major Revision</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_CLASS</name>
              <description>Device Class</description>
              <bitRange>[23:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_CLASS_TEMPEST</name>
                  <description>Stellaris(R) Tempest-class microcontrollers</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_VER</name>
              <description>DID0 Version</description>
              <bitRange>[30:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_VER_1</name>
                  <description>Second version of the DID0 register format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DID1</name>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID1_QUAL</name>
              <description>Qualification Status</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_ROHS</name>
              <description>RoHS-Compliance</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DID1_PKG</name>
              <description>Package Type</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_SOIC</name>
                  <description>SOIC package</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_QFP</name>
                  <description>LQFP package</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_BGA</name>
                  <description>BGA package</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_TEMP</name>
              <description>Temperature Range</description>
              <bitRange>[7:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_C</name>
                  <description>Commercial temperature range (0C to 70C)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_I</name>
                  <description>Industrial temperature range (-40C to 85C)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_E</name>
                  <description>Extended temperature range (-40C to 105C)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PINCNT</name>
              <description>Package Pin Count</description>
              <bitRange>[15:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_64</name>
                  <description>64-pin package</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PRTNO</name>
              <description>Part Number</description>
              <bitRange>[23:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PRTNO_5T36</name>
                  <description>LM3S5T36</description>
                  <value>0x47</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_FAM</name>
              <description>Family</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_FAM_STELLARIS</name>
                  <description>Stellaris family of microcontollers, that is, all devices with external part numbers starting with LM3S</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_VER</name>
              <description>DID1 Version</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_VER_1</name>
                  <description>Second version of the DID1 register format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0</name>
          <description>Device Capabilities 0</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC0_FLASHSZ</name>
              <description>Flash Size</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC0_FLASHSZ_32KB</name>
                  <description>32 KB of Flash</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC0_SRAMSZ</name>
              <description>SRAM Size</description>
              <bitRange>[31:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC0_SRAMSZ_12KB</name>
                  <description>12 KB of SRAM</description>
                  <value>0x2f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1</name>
          <description>Device Capabilities 1</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC1_JTAG</name>
              <description>JTAG Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_SWD</name>
              <description>SWD Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_SWO</name>
              <description>SWO Trace Port Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_WDT0</name>
              <description>Watchdog Timer 0 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_PLL</name>
              <description>PLL Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_TEMP</name>
              <description>Temp Sensor Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_HIB</name>
              <description>Hibernation Module Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_MPU</name>
              <description>MPU Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_ADC0SPD</name>
              <description>Max ADC0 Speed</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC1_ADC0SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC1_ADC1SPD</name>
              <description>Max ADC1 Speed</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC1_ADC1SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC1_MINSYSDIV</name>
              <description>System Clock Divider</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_100</name>
                  <description>Divide VCO (400MHZ) by 5 minimum</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_66</name>
                  <description>Divide VCO (400MHZ) by 2*2 + 2 = 6 minimum</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_50</name>
                  <description>Specifies a 50-MHz CPU clock with a PLL divider of 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_25</name>
                  <description>Specifies a 25-MHz clock with a PLL divider of 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_20</name>
                  <description>Specifies a 20-MHz clock with a PLL divider of 10</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC1_ADC0</name>
              <description>ADC Module 0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_ADC1</name>
              <description>ADC Module 1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_CAN0</name>
              <description>CAN Module 0 Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_WDT1</name>
              <description>Watchdog Timer1 Present</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC2</name>
          <description>Device Capabilities 2</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC2_UART0</name>
              <description>UART Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_UART1</name>
              <description>UART Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_UART2</name>
              <description>UART Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_SSI0</name>
              <description>SSI Module 0 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_SSI1</name>
              <description>SSI Module 1 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_QEI0</name>
              <description>QEI Module 0 Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_I2C0</name>
              <description>I2C Module 0 Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_I2C1</name>
              <description>I2C Module 1 Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_TIMER0</name>
              <description>Timer Module 0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_TIMER1</name>
              <description>Timer Module 1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_TIMER2</name>
              <description>Timer Module 2 Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_COMP0</name>
              <description>Analog Comparator 0 Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_COMP1</name>
              <description>Analog Comparator 1 Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC3</name>
          <description>Device Capabilities 3</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC3_PWM0</name>
              <description>PWM0 Pin Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWM1</name>
              <description>PWM1 Pin Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWM2</name>
              <description>PWM2 Pin Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWM3</name>
              <description>PWM3 Pin Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWM4</name>
              <description>PWM4 Pin Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWM5</name>
              <description>PWM5 Pin Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C0MINUS</name>
              <description>C0- Pin Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C0PLUS</name>
              <description>C0+ Pin Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C0O</name>
              <description>C0o Pin Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C1MINUS</name>
              <description>C1- Pin Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C1PLUS</name>
              <description>C1+ Pin Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C1O</name>
              <description>C1o Pin Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_PWMFAULT</name>
              <description>PWM Fault Pin Present</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN0</name>
              <description>ADC Module 0 AIN0 Pin Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN1</name>
              <description>ADC Module 0 AIN1 Pin Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN2</name>
              <description>ADC Module 0 AIN2 Pin Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN3</name>
              <description>ADC Module 0 AIN3 Pin Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN4</name>
              <description>ADC Module 0 AIN4 Pin Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN5</name>
              <description>ADC Module 0 AIN5 Pin Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN6</name>
              <description>ADC Module 0 AIN6 Pin Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_ADC0AIN7</name>
              <description>ADC Module 0 AIN7 Pin Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP0</name>
              <description>CCP0 Pin Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP1</name>
              <description>CCP1 Pin Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP2</name>
              <description>CCP2 Pin Present</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP3</name>
              <description>CCP3 Pin Present</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP4</name>
              <description>CCP4 Pin Present</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP5</name>
              <description>CCP5 Pin Present</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_32KHZ</name>
              <description>32KHz Input Clock Available</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
